# ANSWERS

### ANS 1

# Five functions of the pandas library are :
    
1. read_csv() - read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame. 
2. head() - head(n) is used to return the first n rows of a dataset. By default, df.head() will return the 
            first 5 rows of the DataFrame.
3. tail() - tail (n) is used to return the first n rows of a dataset. By default, df.tail() will return the 
            last 5 rows of the DataFrame.
4. describe() - used to generate descriptive statistics of the data in a Pandas DataFrame or Series.
5. loc[:] -  helps to access a group of rows and columns in a dataset, a slice of the dataset, as per our requirement.

In [7]:
import pandas as pd
df = pd.read_csv('student.csv' )

In [8]:
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [9]:
df.head(2)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male

In [10]:
df.tail(4)

    id        name  class  mark  gender
31  32   Binn Rott  Seven    90  female
32  33   Kenn Rein    Six    96  female
33  34    Gain Toe  Seven    69    male
34  35  Rows Noump    Six    88  female

In [13]:
df.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [14]:
df.loc[0:3]

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female

In [15]:
df.iloc[0:3]

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

### ANS 2

In [28]:
import pandas as pd 
data = {'A' : [], 'B':[] ,'C':[]}
df = pd.DataFrame(data)
print(df)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [29]:
new_index = [ 1, 3 , 5]
df.reindex(new_index)

    A   B   C
1 NaN NaN NaN
3 NaN NaN NaN
5 NaN NaN NaN

### ANS 3

In [19]:
import pandas as pd 
data = {'Values' : [5,8,12,14,8]}
df = pd.DataFrame(data)
print(df)

   Values
0       5
1       8
2      12
3      14
4       8

In [22]:
total = df.iloc[0:3].sum()
print(total)

Values    25
dtype: int64

### ANS 4

In [3]:
import pandas as pd 
data = {'Text':['Hello World' , 'This is PW Skills' , 'Data Science' , 'Masters' , 'English Batch' ]}
df = pd.DataFrame(data)
print(df)

                Text
0        Hello World
1  This is PW Skills
2       Data Science
3            Masters
4      English Batch

In [4]:
df['Word_count'] = df['Text'].apply(lambda n: len(n.split()))
print(df)

                Text  Word_count
0        Hello World           2
1  This is PW Skills           4
2       Data Science           2
3            Masters           1
4      English Batch           2

### ANS 5



Syntax: dataframe.size
: Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Syntax: dataframe.shape
: Returns tuple of shape (Rows, columns) of dataframe/series

### ANS 6

We can use the pandas module read_excel() function to read the excel file data into a DataFrame object

### ANS 7

In [26]:
import pandas as pd 
data = {'Email':['Krishna@gmail.com' , 'Shree@gmail.com' , 'Utkarsh@gmail.com' , 'Nayak@gmail.com' , 'Divij@gmail.com' ]}
df = pd.DataFrame(data)
print(df)

               Email
0  Krishna@gmail.com
1    Shree@gmail.com
2  Utkarsh@gmail.com
3    Nayak@gmail.com
4    Divij@gmail.com

In [73]:
df['Username'] = df.Email.str.split('@', expand = True)[0]

In [75]:
df

               Email Username
0  Krishna@gmail.com  Krishna
1    Shree@gmail.com    Shree
2  Utkarsh@gmail.com  Utkarsh
3    Nayak@gmail.com    Nayak
4    Divij@gmail.com    Divij

### ANS 8

In [6]:
import pandas as pd 
data = {'A' : [5,12,3,7,2], 'B':[2,9,5,8,3] ,'C':[6,2,8,1,9]}
df = pd.DataFrame(data)
print(df)

    A  B  C
0   5  2  6
1  12  9  2
2   3  5  8
3   7  8  1
4   2  3  9

In [7]:
df[(df['A'] > 5) & (df['B'] <10)]

    A  B  C
1  12  9  2
3   7  8  1

### ANS 9

In [52]:
import pandas as pd 
data = {'Values' : [25,32,30,45,22,41,16,20,9,14]}
df = pd.DataFrame(data)
print(df)

   Values
0      25
1      32
2      30
3      45
4      22
5      41
6      16
7      20
8       9
9      14

In [62]:
df1 = df.Values.mean()

In [63]:
df1

25.4

In [55]:
df2 = df.Values.median()

In [56]:
df2

23.5

In [57]:
df3=df.Values.std()

In [73]:
df3

11.644741302407711

In [75]:
data = {'Values' : [df1 , df2 , df3]}

df = pd.DataFrame(data)
print(df)

      Values
0  25.400000
1  23.500000
2  11.644741

### ANS 10

In [85]:
import pandas as pd 
data = {'Sales' : [100 , 60 , 89 , 105 , 124 , 63 , 88 , 98 , 120 ,  97] , 
        'Date': ['1.3.23' , '2.3.23' , '3.3.23' , '4.3.23', '5.3.23' , '6.3.23' , '7.3.23' , '8.3.23' , '9.3.23' , '10.3.23'] }
df = pd.DataFrame(data)
print(df)

   Sales     Date
0    100   1.3.23
1     60   2.3.23
2     89   3.3.23
3    105   4.3.23
4    124   5.3.23
5     63   6.3.23
6     88   7.3.23
7     98   8.3.23
8    120   9.3.23
9     97  10.3.23

In [112]:
df['Moving_Average'] = df.Sales.rolling(7).mean()

In [113]:
df

   Sales     Date  Moving_Average
0    100   1.3.23             NaN
1     60   2.3.23             NaN
2     89   3.3.23             NaN
3    105   4.3.23             NaN
4    124   5.3.23             NaN
5     63   6.3.23             NaN
6     88   7.3.23       89.857143
7     98   8.3.23       89.571429
8    120   9.3.23       98.142857
9     97  10.3.23       99.285714

### ANS 11

In [37]:
import pandas as pd 
data = {'Date': ['2023.01.28' , '2023.01.29' , '2023.01.30' , '2023.01.31', '2023.02.01' , '2023.02.02' , '2023.02.03' , '2023.02.04' , '2023.02.05'] }
df = pd.DataFrame(data)
print(df)

         Date
0  2023.01.28
1  2023.01.29
2  2023.01.30
3  2023.01.31
4  2023.02.01
5  2023.02.02
6  2023.02.03
7  2023.02.04
8  2023.02.05

In [38]:
df['Weekday'] = df[Date.])

AttributeError: 'dict' object has no attribute 'to_day'

### ANS 13
first and foremost necessary library that needs to
be imported is

* import pandas as pd
* import numpy as np